<?php

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
    // 默认缓存驱动
    'default' => env('cache.driver', 'redis'),

    // 缓存连接方式配置
    'stores' => [
        // 使用redis缓存
        'redis' => [
            // 驱动方式
            'type' => 'Redis',
            // 服务器地址
            'host' => env('cache.host', '127.0.0.1'),
            //  端口号
            'port' => env('cache.port', '6379'),
            //  密码
            'password' => env('cache.password', '123456'),
            //  默认缓存时间
            'timeout' => 3600 * 24 * 7,
            // 使用哪一个db；0 = db0
            'select' => env('cache.select', '1'),
        ]
        // 更多的缓存连接
    ],
];
