<?php
return [
    /**
     * 2024年上半年期末考试
     */
    //形势与政策（三）
    "21080"=>[
        "1"=>[
            "course_id" => "6992",  //课程ID
            "open_id" => "4302",  //开放ID
        ]
    ],
    //数据结构
    "21072"=>[
        "1"=>[
            "course_id" => "3429",  //课程ID
            "open_id" => "1223",  //开放ID
        ]
    ],
    //操作系统
    "21032"=>[
        "1"=>[
            "course_id" => "1017",  //课程ID
            "open_id" => "580",  //开放ID
        ]
    ],
    //SQL Server
    "21030"=>[
        "1"=>[
            "course_id" => "3428",  //课程ID
            "open_id" => "1222",  //开放ID
        ]
    ],
    //微机组装与维护
    "21076"=>[
        "1"=>[
            "course_id" => "1190",  //课程ID
            "open_id" => "615",  //开放ID
        ]
    ],
    //物业管理概论
    "21078"=>[
        "1"=>[
            "course_id" => "5252",  //课程ID
            "open_id" => "2748",  //开放ID
        ]
    ],
    //物业管理法规
    "21077"=>[
        "1"=>[
            "course_id" => "1156",  //课程ID
            "open_id" => "593",  //开放ID
        ]
    ],
    //人力资源管理
    "21065"=>[
        "1"=>[
            "course_id" => "1163",  //课程ID
            "open_id" => "598",  //开放ID
        ]
    ],
    //财务管理
    "21031"=>[
        "1"=>[
            "course_id" => "1014",  //课程ID
            "open_id" => "577",  //开放ID
        ]
    ],

    //装饰材料与施工管理
    "21083"=>[
        "1"=>[
            "course_id" => "1182",  //课程ID
            "open_id" => "608",  //开放ID
        ]
    ],
    //设计心理学
    "21067"=>[
        "1"=>[
            "course_id" => "1181",  //课程ID
            "open_id" => "607",  //开放ID
        ]
    ],
    //空间与表达
    "21062"=>[
        "1"=>[
            "course_id" => "3427",  //课程ID
            "open_id" => "1221",  //开放ID
        ]
    ],
    //构成设计
    "21045"=>[
        "1"=>[
            "course_id" => "3513",  //课程ID
            "open_id" => "1873",  //开放ID
        ]
    ],


    /**
     * 2023年下半年期末考试
     */
    //形势与政策（二）
    "15027" => [
        "1" => [
            "course_id" => "6584",  //课程ID
            "open_id" => "3761",  //开放ID
        ]
    ],
    //微机原理
    "15021" => [
        "1" => [
            "course_id" => "6307",  //课程ID
            "open_id" => "3772",  //开放ID
        ]
    ],
    //毛泽东思想和中国特色社会主义理论体系概论
    "14979" => [
        "1" => [
            "course_id" => "7497",  //课程ID
            "open_id" => "4751",  //开放ID
        ]
    ],
    //计算机应用基础
    "14963" => [
        "1" => [
            "course_id" => "3572",  //课程ID
            "open_id" => "1836",  //开放ID
        ]
    ],
    //计算机网络
    "14962" => [
        "1" => [
            "course_id" => "4180",  //课程ID
            "open_id" => "1835",  //开放ID
        ]
    ],
    //程序设计基础
    "14935" => [
        "1" => [
            "course_id" => "3475",  //课程ID
            "open_id" => "1254",  //开放ID
        ]
    ],
    //展示设计
    "15034"=>[
        "1"=>[
            "course_id" => "3474",  //课程ID
            "open_id" => "1862",  //开放ID
        ]
    ],
    //设计制图
    "14992"=>[
        "1"=>[
            "course_id" => "4800",  //课程ID
            "open_id" => "1934",  //开放ID
        ]
    ],
    //设计学原理
    "14991"=>[
        "1"=>[
            "course_id" => "4780",  //课程ID
            "open_id" => "1844",  //开放ID
        ]
    ],
    //景观设计概论
    "14972"=>[
        "1"=>[
            "course_id" => "6308",  //课程ID
            "open_id" => "3773",  //开放ID
        ]
    ],
];
